import React from 'react';
import Pin from '../../Images/pin.png';

const Features = () => {
    return (
        <div className= "features">
            <img src= {Pin} alt= "Pin Icon" />
            <div className= "featurestext">
                <div>
                    Το <b>Sort-it!</b> προσφέρει τις δυνατότητες ενός εργαλείου Card Sorting. 
                    <br />
                    <br />
                    Ειδικό χαρακτηριστικό είναι η δημιουργία λογαριασμού χρήστη που δίνει πρόσβαση στα βασικά χαρασκτηριστικά της εφαρμογής. Αυτά είναι η δημιουργία και επεξεργασία πειραμάτων ταξινόμησης καρτών. Ο δημιουργός μπορεί να δώσει συγκεκριμένες οδηγίες πριν και μετά τη διεξαγωγή του πειράματος, να επιτρέψει να υπάρξουν μη ταξινομημένες κάρτες, καθώς και να θέσει χρονικό όριο διαθεσιμότητας υποβολής απαντήσεων.
                    <br />
                    <br />
                </div>
                <div style= {{textAlign: 'center'}}>
                    Υποστηρίζονται δυο είδη ταξινόμησης:
                </div>
                <div className= "types">
                    <div id= "type1">
                        <div style= {{textAlign: 'center', textDecoration: 'underline'}}>
                            Ανοιχτό Card Sorting:
                        </div>
                        <br />
                        Oι συμμετέχοντες δημιουργούν τα δικά τους ονόματα για τις κατηγορίες. Αυτό αποκαλύπτει όχι μόνο πως ταξινομούν διανοητικά τις κάρτες, αλλά και ποιους όρους χρησιμοποιούν για να περιγράψουν την κατηγοριοποίηση τους.
                    </div>
                    <div id= "type2">
                        <div style= {{textAlign: 'center', textDecoration: 'underline'}}>
                            Κλειστό Card Sorting:
                        </div>
                        <br />
                        Παρέχεται ένα προκαθορισμένο σύνολο ονοματισμένων κατηγοριών. Οι συμμετέχοντες εκχωρούν τις διάφορες κάρτες σε αυτές τις σταθερές κατηγορίες. Αυτό αποκαλύπτει το βαθμό στον οποίο οι συμμετέχοντες συμφωνούν σχετικά με το ποιες κάρτες ανήκουν σε κάθε κατηγορία.
                    </div>
                </div>
                <br />
                <br />
                <div>
                    Τέλος, δίνεται η δυνατότητα εξαγωγής των αποτελεσμάτων σε διάφορες μορφές (csv, txt) για να γίνει ανάλυση τους από εξειδικευμένο εργαλείο. Πλέον διατίθονται δωρεάν τέτοια εργαλεία ανάλυσης και προκειμένου να υπάρξει όσον το δυνατόν μεγαλύτερη υποστήριξη, διατίθονται οι διαφορετικές μορφές εξαγωγής.
                </div>
            </div>
        </div>
    )
}

export default Features;